Revit 2024 API
ParameterTypeId.ImportAdtComponentsDesc Property
 "Component Description"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ImportAdtComponentsDesc { get; }
Visual Basic
Public Shared ReadOnly Property ImportAdtComponentsDesc As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ImportAdtComponentsDesc {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace